def find_index(arr, x):
    for i in range(len(arr) - 1):
        if arr[i] <= x <= arr[i + 1]:
            return i + 1  # Позначаємо індекс, якщо знайдено відповідний інтервал
    return -1  # Повертаємо -1, якщо не знайдено відповідного інтервалу


def main():
    # створення масиву
    arr = [2, 3, 6, 9, 11, 12, 12, 12, 14, 20, 26, 26, 33, 34, 38, 41]

    # print масиву
    print("Масив 16 елементів:", " ".join(map(str, arr)))

    # Введення цілого числа x користувачем
    x = int(input("Введіть ціле число: "))

    # перевірка чи масив впорядкований
    if all(arr[i] <= arr[i + 1] for i in range(len(arr) - 1)):
        print("Масив впорядкований.")

        # пошук індексу
        index = find_index(arr, x)

        if index != -1:  # на основі колбеку виводимо наступне:
            print("Номер елемента:", index)
            print(f"{arr[index - 1]} <= {x} <= {arr[index]}")
        else:
            print("Такого інтервалу не існує.")
    else:
        print("Помилка: Масив не впорядкований.")


if __name__ == "__main__":
    main()
